Revit 2024 API
PipeFittingAndAccessoryData.FluidDensity Property
 The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double FluidDensity { get; }
Visual Basic
Public ReadOnly Property FluidDensity As Double
	Get
Visual C++
public:
property double FluidDensity {
	double get ();
}
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace